package day13;

public class Java1_성적관리프로그램 {

	public static void main(String[] args) {
		// TODO Auto-generated method stub
		// 1. 학생 추가(학번, 이름, 학과 입력받아서 저장)
		//    -> 학번은 중복 체크 후 저장
		//    -> 학번은 무조건 4자리
		
		// 2. 성적 입력
		//    -> 학번을 입력받은 후 해당 학생 존재하는지 확인
		//    -> 자바, 오라클, HTML 점수를 입력받아서 DB에 저장
		//    -> 점수는 0~100사이 값을 입력받아서 저장 하도록 함
		
		// 3. 성적 확인
		//    -> 학번을 입력받은 후 해당 학생 존재하는지 확인
		//    -> 해당 학생의 이름, 각 과목의 점수를 출력
		
		// 4. 성적 수정
		//    -> 학번을 입력받은 후 해당 학생 존재하는지 확인
		//    -> 수정하고자 하는 과목 선택(1.자바, 2.오라클, 3.HTML)
		//    -> 점수 입력받은 후(0~100) 수정
		
		// 5. 종료
	}

}
